{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day",
        "Whats up",
        "Good morning",
        "Good evening",
        "hello",
        "hey",
        "what's up"
      ],
      "responses": ["Hello!", "Good to see you!", "Hi there, how can I help?"],
      "context_set": "greeting"
    },
    {
      "tag": "goodbye",
      "patterns": [
        "cya",
        "See you later",
        "Goodbye",
        "I am Leaving",
        "Have a Good day",
        "bye",
        "i have to go",
        "gotta go"
      ],
      "responses": ["Sad to see you go :(", "Talk to you later", "Goodbye!"],
      "context_set": "goodbye"
    },
    {
      "tag": "age",
      "patterns": [
        "how old",
        "how old are you",
        "what is your age",
        "how old are you",
        "age?"
      ],
      "responses": ["I am old and wise", "trying to stay fit and young!"],
      "context_set": "age"
    },
    {
      "tag": "name",
      "patterns": [
        "Can you please tell me your name?",
        "What's the name you go by?",
        "Could you share your name with me?",
        "I'm sorry, I didn't catch your name. What is it?",
        "May I have the pleasure of knowing your name?",
        "What should I address you as?",
        "What is the name that you prefer to be called by?",
        "Excuse me, but may I ask for your name?",
        "Would you kindly tell me your name?",
        "Can you please introduce yourself?",
        "What is your given name?",
        "How would you like to be addressed?",
        "What name do you respond to?",
        "Could you let me know your name?",
        "Who am I speaking with?",
        "What name do you use?",
        "Could you disclose your name to me?",
        "I apologize, but I didn't catch your name earlier. What is it?",
        "What should I call you?",
        "How do you like to be called?",
        "Can you share your name with me, please?",
        "What is your name, if you don't mind me asking?",
        "Who are you, exactly?",
        "What do you call yourself?",
        "May I ask what your name is?",
        "What name should I use to refer to you?",
        "Could you tell me what your name is, please?",
        "What is your name and surname?",
        "What are you called?",
        "May I know your name, please?"
      ],
      "responses": [
        "You can call me JameaElfna Assistance.",
        "I'm JameaElfna Assistance!",
        "I'm JameaElfna Assistance."
      ],
      "context_set": "name"
    },
    {
      "tag": "Marrakech",
      "patterns": [
        "Where Marrakech locate",
        "Where is Marrakech",
        "in which country Marrakech is ",
        "is Marrakech a city",
        "Where is Marrakesh?",
        "what is Marrakesh?",
        "What is the location of Marrakech?",
        "Marrakech is where?",
        "In which place is Marrakech located?",
        "In which country is Marrakech located?",
        "Marrakech is located where?",
        "Where is Marrakesh located?",
        "Where exactly is Marrakech?",
        "What is the location of Marrakech?",
        "Marrakech is in which country?",
        "What city is Marrakech in?",
        "Where can we find Marrakech?",
        "Marrakech is in which region?",
        "Marrakech is in which corner?",
        "Where is Marrakech located?",
        "Where can we find Marrakech?",
        "In which part of the world is Marrakech located?",
        "Marrakech is located in which region?",
        "Marrakech is in which geographical area?"
      ],
      "responses": [
        "Marrakech is a Moroccan city and one of the most touristic cities in the world"
      ],
      "context_set": "Marrakech"
    },
    {
      "tag": "Visa Requirements",
      "patterns": [
        "What documents are needed to obtain a Moroccan visa?",
        "How long does it take to get a Moroccan visa?",
        "Is it possible to get a visa on arrival in Morocco?",
        "What is the cost of a Moroccan visa?",
        "Are there any specific visa requirements for visiting Morocco?",
        "What is the duration of a Moroccan tourist visa?",
        "How can I check the status of my Moroccan visa application?",
        "What is the validity period of a Moroccan visa?",
        "Can I extend my Moroccan tourist visa?",
        "What are the requirements for a Moroccan business visa?",
        "What are the processing times for a Moroccan visa?",
        "What are the entry requirements for Moroccan nationals?",
        "Can I apply for a Moroccan visa online?",
        "What is the maximum stay allowed on a Moroccan tourist visa?",
        "How many entries are allowed on a Moroccan visa?",
        "What are the requirements for a Moroccan student visa?",
        "What are the requirements for a Moroccan work visa?",
        "What is the process for obtaining a Moroccan visa?",
        "What is the difference between a Moroccan single entry visa and a multiple entry visa?",
        "Can I get a Moroccan visa on the same day?",
        "What are the Moroccan visa requirements for US citizens?",
        "What are the Moroccan visa requirements for UK citizens?",
        "What are the Moroccan visa requirements for Canadian citizens?",
        "What are the Moroccan visa requirements for Australian citizens?",
        "What are the Moroccan visa requirements for EU citizens?",
        "Can I get a refund for my Moroccan visa application fee?",
        "What is the Moroccan visa application process for minors?",
        "What is the Moroccan visa application process for senior citizens?",
        "What are the medical requirements for obtaining a Moroccan visa?",
        "Can I visit other countries with a Moroccan visa?"
      ],
      "responses": [
        "Visitors from certain countries do not require a visa for stays up to 90 days. Other visitors will need to obtain a visa before arriving in Morocco. Please check with your local Moroccan embassy or consulate for more information You can apply for a visa through the Moroccan embassy or consulate in your country. The application process can take several weeks, so it's important to plan ahead , The type of visa you need will depend on the purpose of your visit, the length of your stay, and your nationality. Please consult with your local Moroccan embassy or consulate for more information."
      ],
      "context_set": "Visa Requirements"
    },
    {
      "tag": "Hotels",
      "patterns": [
        "What are some good places to stay in Marrakech?",
        "How can I find affordable hotels in Marrakech?",
        "What are some luxury hotels in Marrakech?",
        "What are the best areas to stay in Marrakech?",
        "What are the most popular hotels in Marrakech?",
        "How much does it cost to stay in a hotel in Marrakech?",
        "What are some good hotels near Marrakech airport?",
        "What are some good family-friendly hotels in Marrakech?",
        "What are some good hotels for couples in Marrakech?",
        "What are some good hotels with a pool in Marrakech?",
        "What are some good hotels with a spa in Marrakech?",
        "What are some good hotels with a view in Marrakech?",
        "What are some good hotels with a rooftop terrace in Marrakech?",
        "What are some good hotels with a bar in Marrakech?",
        "What are some good hotels with a restaurant in Marrakech?",
        "What are some good hotels with a gym in Marrakech?",
        "What are some good hotels with a shuttle service in Marrakech?",
        "What are some good hotels with free breakfast in Marrakech?",
        "What are some good budget hotels in Marrakech?",
        "What are some good mid-range hotels in Marrakech?",
        "What are some good high-end hotels in Marrakech?",
        "What are some good boutique hotels in Marrakech?",
        "What are some good hotels with a Moroccan-style decor in Marrakech?",
        "What are some good hotels with a Western-style decor in Marrakech?",
        "What are some good hotels with a traditional courtyard in Marrakech?",
        "What are some good hotels with a garden in Marrakech?",
        "What are some good hotels with a pool and garden in Marrakech?",
        "What are some good hotels with a hammam in Marrakech?",
        "What are some good hotels with a jacuzzi in Marrakech?",
        "What are some good hotels with a fireplace in Marrakech?",
        "Are there any all-inclusive resorts in Marrakech?",
        "What are the top-rated resorts in Marrakech?",
        "What are some good family-friendly resorts in Marrakech?",
        "What are some good resorts for couples in Marrakech?",
        "What are some good resorts with a pool in Marrakech?",
        "What are some good resorts with a spa in Marrakech?",
        "What are some good resorts with a view in Marrakech?",
        "What are some good resorts with a rooftop terrace in Marrakech?",
        "What are some good resorts with a bar in Marrakech?",
        "What are some good resorts with a restaurant in Marrakech?",
        "What are some good resorts with a gym in Marrakech?",
        "What are some good resorts with a shuttle service in Marrakech?",
        "What are some good all-inclusive resorts in Marrakech?",
        "What are some good luxury resorts in Marrakech?",
        "What are some good budget resorts in Marrakech?",
        "What are some good mid-range resorts in Marrakech?",
        "What are some good high-end resorts in Marrakech?",
        "What are some good resorts with a Moroccan-style decor in Marrakech?",
        "What are some good resorts with a private beach in Marrakech?",
        "What are some good resorts with a golf course in Marrakech?",
        "What are some good resorts with a kids' club in Marrakech?",
        "What are some good resorts with a water park in Marrakech?",
        "What are some good resorts with a casino in Marrakech?",
        "What are some good resorts with an adult-only section in Marrakech?",
        "What are some good resorts with a beachfront location in Marrakech?",
        "What are some good resorts with a marina in Marrakech?",
        "What are some good resorts with an outdoor pool in Marrakech?",
        "What are some good resorts with an indoor pool in Marrakech?",
        "What are some good resorts with a jacuzzi in Marrakech?",
        "What are some good resorts with a sauna in Marrakech?",
        "What are some good resorts with a steam room in Marrakech?",
        "What are some good resorts with a tennis court in Marrakech",
        "What are some good places to stay in Marrakech?",
        "How can I find affordable accommodation in Marrakech?",
        "Are there any all-inclusive resorts in Marrakech?",
        "Can I rent an apartment in Marrakech for a month?",
        "What are the best areas to stay in Marrakech?",
        "What are some luxury hotels in Marrakech?",
        "Are there any budget hostels in Marrakech?",
        "What are the most popular riads in Marrakech?",
        "What are some good guesthouses in Marrakech?",
        "What are the top-rated resorts in Marrakech?",
        "How much does it cost to rent an apartment in Marrakech?",
        "What are some good neighborhoods to rent an apartment in Marrakech?",
        "How can I find short-term rentals in Marrakech?",
        "What are some good homestays in Marrakech?",
        "Are there any eco-friendly accommodations in Marrakech?",
        "What are the best hotels near Marrakech airport?",
        "What are some good riads with a pool in Marrakech?",
        "What are some good family-friendly hotels in Marrakech?",
        "What are some good hotels for couples in Marrakech?",
        "Are there any all-inclusive resorts in Marrakech?",
        "How can I find pet-friendly accommodations in Marrakech?",
        "What are some good accommodations in Marrakech for solo travelers?",
        "What are some good accommodations in Marrakech for backpackers?",
        "What are some good accommodations in Marrakech for digital nomads?",
        "What are some good accommodations in Marrakech for hikers?",
        "What are some good accommodations in the Atlas Mountains near Marrakech?",
        "What are some good accommodations in the Sahara Desert near Marrakech?",
        "Are there any campgrounds in Marrakech?",
        "How can I find a Marrakech host family?",
        "What are some good accommodations in Marrakech for long-term stays?"
      ],
      "responses": [
        "There are many hotels, guesthouses, resorts , riads  and traditional Moroccan houses to choose from in Marrakech. Some popular options include : \n  - La Mamounia \n  - Four Seasons Resort Marrakech \n  - Riad Kniza \n for more details visit the hotels section of our website."
      ],
      "context_set": "Hotels"
    },
    {
      "tag": "Transportation",
      "patterns": [
        "What are the best modes of transportation to get around Marrakech?",
        "What is the best way to get around the Medina in Marrakech?",
        "What is the cheapest way to get from the airport to the city center in Marrakech?",
        "Are there any bike rental options in Marrakech for sightseeing?",
        " What is the average cost of taking a taxi within Marrakech?",
        "How long does it take to travel from Marrakech to the Atlas Mountains?",
        "Are there any public transportation options for getting to the Marrakech Palm Grove?",
        "What is the best way to get to Jardin Majorelle from Marrakech city center?",
        "Can I hire a private driver to take me around Marrakech for the day?",
        "What are the typical taxi fares in Marrakech for a short ride?",
        "Are there any eco-friendly transportation options available in Marrakech?",
        "What is the best way to get around Marrakech during rush hour?",
        "How much does it cost to rent a scooter in Marrakech?",
        "What is the easiest way to get from Marrakech to the Ourika Valley?",
        "What are the best ways to get to the Ben Youssef Madrasa from Marrakech?",
        "What is the best way to get from Marrakech to the Menara Gardens?",
        "Are there any shared taxi options for traveling within Marrakech?",
        "Can I rent a bicycle in Marrakech for a day trip?",
        "What is the most convenient way to travel from Marrakech to the Ouzoud Waterfalls?",
        "What is the easiest way to travel from Marrakech to the Koutoubia Mosque?",
        "How can I travel to Bahia Palace from the Marrakech train station?",
        "What is the fastest way to get to the Saadian Tombs from Marrakech city center?",
        "Are there any hop-on, hop-off bus tours in Marrakech?",
        "Can I take a horse-drawn carriage ride in Marrakech and where can I find them?",
        "How do I get to the Marrakech Museum using public transportation?",
        "Are there any guided walking tours available for exploring Marrakech?",
        "What is the best way to get to the El Badi Palace from Marrakech?",
        "How do I get to the Marrakech Souks using public transportation?",
        "What is the best way to get to the Dar Si Said Museum from Marrakech?",
        "Can I take a tuk-tuk ride in Marrakech and where can I find them?",
        "What is the best way to get to the Jardin Secret from Marrakech?",
        "How do I get to the Marrakech Museum of Photography using public transportation?",
        "What is the best way to get to the Marrakech Museum of Contemporary Art from Marrakech?",
        "How do I get to the Marrakech Museum of Islamic Art using public transportation?",
        "What is the best way to get to the Marrakech Museum of Photography from Marrakech?",
        "How do I get to the Marrakech Museum of Contemporary Art using public transportation?",
        "What is the best way to get to the Marrakech Museum of Islamic Art from Marrakech?",
        "How do I get to the Marrakech Museum of Photography using public transportation?",
        "What is the best way to get to the Marrakech Museum of Contemporary Art from Marrakech?",
        "How do I get to the Marrakech Museum of Islamic Art using public transportation?",
        "What is the best way to get to the Marrakech Museum of Photography from Marrakech?",
        "What are the available modes of transportation in Marrakech?",
        "How do I get from Marrakech Menara Airport to the city center?",
        "Are there taxis available in Marrakech?",
        "Are there any public buses in Marrakech?",
        "How much does a taxi ride cost in Marrakech?",
        "Is it safe to use public transportation in Marrakech?",
        "What is the best way to get around Marrakech?",
        "Is there a train station in Marrakech?",
        "How do I get to other cities from Marrakech?",
        "Are there any bike rentals available in Marrakech?",
        "Are there any restrictions on driving in Marrakech?",
        "Can I rent a car in Marrakech as a tourist?",
        "How do I buy tickets for public transportation in Marrakech?",
        "What is the frequency of public transportation in Marrakech?",
        "Is Uber or any other ride-sharing service available in Marrakech?",
        "What is the best way to travel from Marrakech to the Atlas Mountains?",
        "Are there any water taxis or boats available in Marrakech?",
        "Is there any specific transportation to reach tourist attractions in Marrakech?",
        "Can I walk to most tourist attractions in Marrakech?",
        "Are there any transportation options available for disabled travelers in Marrakech?"
      ],
      "responses": {
        "internal": [
          " - Taxis are a convenient and relatively cheap mode of transportation in Marrakech. Be sure to negotiate the price with the driver before getting in to avoid any misunderstandings. \n - Marrakech has a comprehensive public bus network that covers most of the city's major areas. Bus fares are low, making it a good option for those on a tight budget. \n - Horse-drawn carriages, known as caleches, are a popular way to explore Marrakech's main tourist areas. \n - Bicycles can be rented from various locations around the city, but cyclists should exercise caution due to Marrakech's chaotic traffic. \n - Many of Marrakech's famous attractions are within walking distance of each other, but be prepared for the heat in the summer months."
        ],
        "external": [
          "There are several ways to get transported from Marrakech to other cities in Morocco. Here are some options: \n - By bus: There are several bus companies that operate services from Marrakech to other cities.You can book your ticket online or buy it from the bus station. \n - By train: The national railway company ONCF operates trains from Marrakech to several cities in Morocco. The train station is located in the city center, and you can buy your ticket online or at the station. \n - By taxi: You can hire a taxi to take you to other cities. You can either negotiate a price with the driver or use a shared taxi service, which is cheaper but may take longer as it waits for other passengers. \n - By car: You can rent a car and drive to other cities. This gives you the freedom to stop at places along the way and explore different parts of Morocco. \n - By air: Marrakech has an international airport with flights to several cities in Morocco and other countries. This is the fastest way to get to other cities. "
        ]
      },
      "context_set": "Transportation"
    },
    {
      "tag": "Why Expatriate",
      "patterns": [
        "What are the benefits of relocating to Marrakech?",
        "What makes Marrakech an attractive destination to move to?",
        "Why should someone consider moving to Marrakech?",
        "What are the advantages of living in Marrakech?",
        "What are the selling points of moving to Marrakech?",
        "What are the pros of choosing Marrakech as your new home?",
        "What positive aspects of life in Marrakech should I consider before moving there?",
        "Why is Marrakech a popular destination for expats?",
        "What are some compelling reasons to relocate to Marrakech?",
        "What are the top reasons to move to Marrakech?",
        "What are the perks of living in Marrakech?",
        "How does moving to Marrakech improve your life?",
        "What are the advantages of living in Marrakech compared to other countries?",
        "Why is Marrakech a great place to live and work?",
        "What are the main reasons people choose to move to Marrakech?",
        "How can moving to Marrakech benefit me?",
        "What are the positive aspects of Moroccan culture and lifestyle?",
        "What are the opportunities for expats in Marrakech?",
        "What are the key reasons to consider relocating to Marrakech?",
        "What makes Marrakech an appealing place to live?",
        "What are the good things about living in Marrakech?",
        "How does moving to Marrakech enhance your quality of life?",
        "What are the advantages of living in Marrakech as an expat?",
        "Why is Marrakech a top choice for people looking to relocate?",
        "What are the main factors that make Marrakech a desirable place to live?",
        "What are the benefits of choosing Marrakech as a destination for retirement?",
        "What are the advantages of starting a business in Marrakech?",
        "What are the best things about the Moroccan lifestyle?",
        "What are the reasons people fall in love with Marrakech?",
        "What are the key selling points of living in Marrakech?",
        "What are the benefits of relocating to Marrakech?",
        "What makes Marrakech an attractive destination to move to?",
        "Why should someone consider moving to Marrakech?",
        "What are the advantages of living in Marrakech?",
        "What are the selling points of moving to Marrakech?",
        "What are the pros of choosing Marrakech as your new home?",
        "What positive aspects of life in Marrakech should I consider before moving there?",
        "Why is Marrakech a popular destination for expats?",
        "What are some compelling reasons to relocate to Marrakech?",
        "What are the top reasons to move to Marrakech?",
        "What are the perks of living in Marrakech?",
        "How does moving to Marrakech improve your life?",
        "What are the advantages of living in Marrakech compared to other countries?",
        "Why is Marrakech a great place to live and work?",
        "What are the main reasons people choose to move to Marrakech?",
        "How can moving to Marrakech benefit me?",
        "What are the positive aspects of Moroccan culture and lifestyle?",
        "What are the opportunities for expats in Marrakech?",
        "What are the key reasons to consider relocating to Marrakech?",
        "What makes Marrakech an appealing place to live?",
        "What are the good things about living in Marrakech?",
        "How does moving to Marrakech enhance your quality of life?",
        "What are the advantages of living in Marrakech as an expat?",
        "Why is Marrakech a top choice for people looking to relocate?",
        "What are the main factors that make Marrakech a desirable place to live?",
        "What are the benefits of choosing Marrakech as a destination for retirement?",
        "What are the advantages of starting a business in Marrakech?",
        "What are the best things about the Moroccan lifestyle?",
        "What are the reasons people fall in love with Marrakech?",
        "What are the key selling points of living in Marrakech?",
        "Why Marrakech is a best city to live in ?"
      ],
      "responses": [
        "If Marrakech  attracts so many foreign expatriates, it is not for nothing. The reasons for moving to this city are not lacking, as its assets are numerous : \n  - There is so many Sweetness of life and quality of life \n  - An attractive cost of living and  pleasant climate \n  - A welcoming destination for every one \n  - The very identity of the city (its gastronomy,beaches,architecture, traditional crafts and its sublime landscapes and varied)"
      ],
      "context_set": "Why Expatriate"
    },
    {
      "tag": "how Expatriate",
      "patterns": [
        "Which type of residency permit is needed to become an expat in Morocco?",
        "What kind of visa is required for expatriation in Morocco?",
        "What type of permit is necessary to live as an expatriate in Morocco?",
        "What residency status is required for expats in Morocco?",
        "Which type of residence permit is necessary for expats in Morocco?",
        "What is the residency requirement for becoming an expat in Morocco?",
        "What type of visa is necessary to relocate to Morocco?",
        "What kind of residency permit is needed to live in Morocco as an expat?",
        "What is the visa requirement for living in Morocco as an expat?",
        "Which type of residency permit is mandatory for expats in Morocco?",
        "What is the necessary permit for expats to live in Morocco?",
        "What type of visa do I need to become an expat in Morocco?",
        "What is the necessary visa for living as an expat in Morocco?",
        "What type of residency status do expats need in Morocco?",
        "What is the residency requirement for expats in Morocco?",
        "Which type of permit is required for expats to live in Morocco?",
        "What kind of visa is essential for living in Morocco as an expat?",
        "What type of residence permit is mandatory for living in Morocco as an expat?",
        "What visa is required for expats to live in Morocco?",
        "What is the necessary permit for expats to work in Morocco?",
        "What kind of residency permit is necessary for working in Morocco as an expat?",
        "What type of visa is required to work in Morocco as an expat?",
        "Which residency status is needed for expats to work in Morocco?",
        "What type of permit is mandatory for expats to work in Morocco?",
        "What is the visa requirement for working in Morocco as an expat?",
        "What kind of residency permit is needed to start a business in Morocco as an expat?",
        "What type of permit is necessary for entrepreneurs to live in Morocco as an expat?",
        "What is the residency requirement for expat entrepreneurs in Morocco?",
        "What kind of visa is required to establish a business in Morocco as an expat?",
        "Which type of permit is necessary for starting a business in Morocco as an expat?"
      ],
      "responses": [
        "The French only need a valid passport to enter the kingdom. However, this stay cannot exceed 90 days \nTo move to Morocco, there are two types of residence permits depending on the duration of your expatriation:\n- The registration card: this is valid for one to ten years as long as you do not leave the territory for more than six months during this period. Once the validity period expires, you must have a residence card or a renewal to stay in the country.\n- The residence card: to obtain this residence permit, it is essential to justify a four-year and uninterrupted residence in Morocco. The card is issued for ten years and can be renewed. This option is therefore aimed at people who wish to settle in Morocco permanently.\nNote that it is mandatory to have a valid residence permit to carry out certain administrative procedures (opening a bank account, consular card, etc.).\nGood to know: children under 16 are not affected by registration."
      ],
      "context_set": "how Expatriate"
    },
    {
      "tag": "jobs",
      "patterns": [
        "What are the best jobs in Marrakech?",
        "What are the most common industries for employment in Morocco?",
        "Can foreigners start their own business in Morocco?",
        "What is the process for starting a business in Morocco?",
        "Are there any tax incentives for companies in Morocco?",
        "What is the corporate tax rate in Morocco?",
        "How do I register my company with the Moroccan government?",
        "What are the requirements for opening a bank account for my business in Morocco?",
        "What is the process for obtaining a trade license in Morocco?",
        "Can I hire Moroccan employees for my business if I am a foreigner?",
        "What are the labor laws in Morocco regarding working hours?",
        "Is there a maximum number of working hours per week in Morocco?",
        "What is the overtime pay rate in Morocco?",
        "Are there any restrictions on the employment of women in Morocco?",
        "What are the requirements for employing minors in Morocco?",
        "What is the process for terminating an employee's contract in Morocco?",
        "What are the notice periods for terminating an employee's contract in Morocco?",
        "Can an employer terminate an employee's contract without notice in Morocco?",
        "What are the rules for severance pay in Morocco?",
        "How do I calculate severance pay for an employee in Morocco?",
        "What is the process for obtaining a work permit in Morocco?",
        "Can I apply for a work permit before I arrive in Morocco?",
        "What is the duration of a work permit in Morocco?",
        "How do I renew my work permit in Morocco?",
        "Are there any quotas on the number of work permits issued in Morocco?",
        "Can I work in Morocco without a work permit?",
        "What are the consequences of working in Morocco without a work permit?",
        "What are the requirements for obtaining a self-employment visa in Morocco?",
        "Can I work as a freelancer in Morocco without a work permit?",
        "What are the tax implications of working as a freelancer in Morocco?",
        "Am I required to contribute to the social security system in Morocco as an employee?",
        "What is the process for applying for unemployment benefits in Morocco?",
        "What is the duration of unemployment benefits in Morocco?",
        "Are there any training programs available for unemployed individuals in Morocco?",
        "Can I work remotely for a company in another country while living in Morocco?",
        "What are the tax implications of working remotely for a foreign company while living in Morocco?",
        "Are there any language requirements for working in Morocco?",
        "What are the most common languages spoken in the workplace in Morocco?"
      ],
      "responses": [
        "To work in Morocco, in addition to your passport and a residence permit, you need, depending on your status: an employment contract, an authorization to practice (for the liberal professions) or to register in the commercial register (for entrepreneurs)"
      ],
      "context_set": "jobs"
    },
    {
      "tag": "prices",
      "patterns": [
        "What is the average cost of renting an apartment in Morocco?",
        "How much does it typically cost to eat at a restaurant in Morocco?",
        "What is the average price of a flight to Morocco?",
        "How much should I expect to pay for a guided tour in Morocco?",
        "What is the typical cost of transportation within Morocco?",
        "What is the average price of souvenirs in Morocco?",
        "How much does it cost to visit historical sites in Morocco?",
        "What is the typical price of a camel ride in Morocco?",
        "How much should I budget for activities in Morocco?",
        "What is the average cost of travel insurance for a trip to Morocco?",
        "How much does it cost to get a visa for Morocco?",
        "What is the typical price of a Hammam spa experience in Morocco?",
        "How much should I budget for shopping in Morocco?",
        "What is the average cost of a hot air balloon ride in Morocco?",
        "How much does it cost to take a cooking class in Morocco?",
        "What is the typical price of a guided hike in Morocco?",
        "How much should I expect to pay for a day trip in Morocco?",
        "What is the average cost of a traditional Moroccan meal?",
        "How much does it cost to rent a bike in Morocco?",
        "What is the typical price of a taxi ride in Morocco?",
        "How much should I budget for a desert safari in Morocco?",
        "What is the average cost of a surfing lesson in Morocco?",
        "How much does it cost to rent a quad bike in Morocco?",
        "What is the typical price of a horseback riding tour in Morocco?",
        "How much should I expect to pay for a bus ticket in Morocco?",
        "What is the average cost of a private yacht charter in Morocco?",
        "How much does it cost to rent a jet ski in Morocco?",
        "What is the typical price of a paragliding experience in Morocco?",
        "How much should I budget for a visit to a Moroccan spa?",
        "What is the average cost of a guided tour of Moroccan gardens?",
        "How much does it cost to attend a music festival in Morocco?",
        "What is the typical price of a private tour of Moroccan palaces?",
        "How much should I expect to pay for a visit to a Moroccan museum?",
        "What is the average cost of a Moroccan calligraphy workshop?",
        "How much does it cost to take a photography tour in Morocco?",
        "What is the typical price of a pottery-making class in Morocco?",
        "How much should I budget for a trip to a Moroccan winery?",
        "What is the average cost of a guided tour of a Moroccan medina?",
        "How much does it cost to rent a kayak in Morocco?",
        "What is the typical price of a Moroccan spice market tour?",
        "How much should I expect to pay for a visit to a Moroccan rug factory?",
        "What is the average cost of a sunset camel ride in Morocco?",
        "How much does it cost to take a calligraphy class in Morocco?",
        "What is the typical price of a guided tour of Moroccan waterfalls?",
        "How much should I budget for a visit to a Moroccan pottery market?",
        "What is the average cost of a guided tour of a Moroccan kasbah?",
        "How much does it cost to take a birdwatching tour in Morocco?",
        "What is the typical price of a Moroccan henna tattoo?",
        "How much should I expect to pay for a visit to a Moroccan tannery?"
      ],
      "responses": {
        "hotels": [
          "The average price of hotels in Marrakech can vary depending on the time of year, the location, and the type of accommodation. However the average price range for a mid-range hotel in Marrakech is around $50 to $100 per night, while luxury hotels could range from $150 to $500 per night and it's for more details visit the hotels section of our website"
        ],
        "restaurants": [
          "The average price of a meal in a restaurant in Marrakech can vary depending on the type of restaurant and location. In general, you can expect to pay around 100-200 Moroccan Dirhams (roughly 10-20 USD) for a basic meal at a local restaurant or cafe.\n If you are dining at a higher-end restaurant or a touristy area, the price can be significantly higher, and you can expect to pay around 300-500 Moroccan Dirhams (roughly 30-50 USD) or more for a meal.\n It's worth noting that many restaurants in Marrakech also offer set menus or prix-fixe menus, which can be a more cost-effective way to enjoy a meal. Additionally, street food stalls and markets offer delicious and affordable food options for budget travelers"
        ],
        "transportation": [
          "The average transportation price in Marrakech, Morocco varies depending on the mode of transportation you choose. Here are some estimated prices for common transportation options in Marrakech: \n - Taxi: Taxis are a common mode of transportation in Marrakech. The starting fare is around 2.50 MAD (Moroccan Dirham), and then the fare increases by 1.60 MAD per kilometer traveled. For example, a 5-kilometer ride would cost around 10.50 MAD.\n - Bus: The cost of a bus ride in Marrakech is around 4 MAD per person. However, keep in mind that buses can be crowded and may not always run on schedule.\n - Horse-drawn carriage: A popular tourist attraction in Marrakech is a ride on a horse-drawn carriage, known as a 'caleche.' Prices vary, but expect to pay around 150-200 MAD for a 45-minute ride.\n - Bicycle: If you prefer to explore Marrakech on two wheels, you can rent a bicycle for around 50-100 MAD per day.\n Keep in mind that prices can vary depending on the time of day and the season. It's always a good idea to negotiate prices in advance, especially with taxi drivers and horse-drawn carriage operators."
        ],
        "flights": [
          "The average price to fly to Morocco can vary depending on the time of year, the departure city, and the airline you choose. As chatbot assistance, I don't have access to real-time data, it's always best to check with various airlines and travel booking websites to get the most accurate and up-to-date prices for your desired travel dates"
        ],
        "guided tours": [
          "The average price of a guided tour in Morocco can vary depending on the type of tour and the level of luxury. For example, a basic city tour can cost around 200-300 Moroccan Dirhams (MAD), while a more specialized tour, such as a guided visit to a palace or a historical site, may cost around 500-700 MAD.\n If you're interested in outdoor activities, such as trekking or a desert tour, prices can range from 1,000 to 3,000 MAD, depending on the duration and the level of comfort.\nIt's important to note that prices may vary depending on the season, the popularity of the activity, and the bargaining skills of the buyer."
        ],
        "souvenirs": [
          "The average price of souvenirs in Morocco can vary depending on the type of souvenir you choose. For example, a traditional Moroccan rug can cost anywhere from 100-500 MAD, while a traditional Moroccan lantern can cost around 50-100 MAD."
        ],
        "activities": [
          "The cost of a touristic activity in Marrakech can vary depending on the type of activity and the level of luxury. For example, a basic city tour can cost around 200-300 Moroccan Dirhams (MAD), while a more specialized tour, such as a guided visit to a palace or a historical site, may cost around 500-700 MAD.\n If you're interested in outdoor activities, such as trekking or a desert tour, prices can range from 1,000 to 3,000 MAD, depending on the duration and the level of comfort.\nIt's important to note that prices may vary depending on the season, the popularity of the activity, and the bargaining skills of the buyer."
        ],
        "travel_insurance": [
          "the cost of travel insurance in Morocco can vary depending on the type of insurance you choose, the duration of your trip, and other factors. For example, a basic travel insurance plan for a 10-day trip to Morocco can cost around 20-30 USD, while a more comprehensive plan can cost around 50-100 USD."
        ],
        "visas": [
          "the cost of a visa to Morocco can vary depending on various factors such as the type of visa, the duration of stay, the country of origin, and other circumstances.\n  It is recommended that you check with the Moroccan embassy or consulate in your country or visit the official website of the Moroccan Ministry of Foreign Affairs to find out the latest information on visa requirements and fees"
        ],
        "apartment": [
          "the average price of an accommodation apartment in Marrakech can vary widely depending on the location, size, and amenities of the apartment.\nOn average, the cost of renting an apartment in the city center of Marrakech is approximately 4,000-6,000 Moroccan Dirham (MAD) per month (equivalent to approximately $430-$650 USD), while outside the city center, the cost drops to around 2,500-4,000 MAD per month (equivalent to approximately $270-$430 USD). However, please keep in mind that these are rough estimates and actual prices may vary depending on many factors."
        ],
        "Hammam spa": [
          "The average price of a hammam spa in Marrakech can vary depending on the type of hammam you choose. For example, a basic hammam experience can cost around 100-200 Moroccan Dirhams (MAD), while a more luxurious hammam experience can cost around 300-500 MAD.\n It's important to note that prices may vary depending on the season, the popularity of the hammam, and the bargaining skills of the buyer."
        ],
        "tannery": [
          "The average price of a visit to a Moroccan tannery can vary depending on the type of tannery you choose. For example, a basic tannery experience can cost around 100-200 Moroccan Dirhams (MAD), while a more luxurious tannery experience can cost around 300-500 MAD.\n It's important to note that prices may vary depending on the season, the popularity of the tannery, and the bargaining skills of the buyer."
        ],
        "sunset camel ride": [
          "The average price of a sunset camel ride in Marrakech can vary depending on the type of camel ride you choose. For example, a basic camel ride experience can cost around 100-200 Moroccan Dirhams (MAD), while a more luxurious camel ride experience can cost around 300-500 MAD.\n It's important to note that prices may vary depending on the season, the popularity of the camel ride, and the bargaining skills of the buyer."
        ]
      },
      "context_set": "prices"
    },
    {
      "tag": "weather",
      "patterns": [
        "What's the weather like in Marrakech today?",
        "What's the temperature in Marrakech right now?",
        "Is it going to rain in Marrakech tomorrow?",
        "What's the forecast for Marrakech this week?",
        "What's the weather like in Marrakech during the summer?",
        "What's the weather like in Marrakech during the winter?",
        "Does it get cold in Marrakech?",
        "What's the average temperature in Marrakech in January?",
        "What's the average temperature in Marrakech in July?",
        "What's the humidity like in Marrakech?",
        "Does it snow in Marrakech?",
        "What's the chance of rain in Marrakech in October?",
        "What's the chance of rain in Marrakech in May?",
        "What's the wind like in Marrakech?",
        "What's the UV index in Marrakech?",
        "What's the best time of year to visit Marrakech for good weather?",
        "Is Marrakech sunny all year round?",
        "What's the worst time of year to visit Marrakech for bad weather?",
        "What's the best time of year to visit Marrakech to avoid crowds?",
        "What's the best time of year to visit Marrakech for festivals and events?",
        "Is it safe to travel to Marrakech during the rainy season?",
        "What should I pack for the weather in Marrakech?",
        "Is it too hot to visit Marrakech in August?",
        "What's the temperature like in the Marrakech Medina?",
        "What's the temperature like in the Marrakech Palmeraie?",
        "What's the temperature like in the Marrakech Atlas Mountains?",
        "What's the temperature like in the Marrakech Desert?",
        "How many hours of sunlight can I expect in Marrakech in February?",
        "What's the coldest it gets in Marrakech?",
        "What's the hottest it gets in Marrakech?"
      ],
      "responses": [
        "The weather in Marrakech is typically hot and dry, with an average temperature of 22째C (72째F) in the winter and 30째C (86째F) in the summer. The city is located in a desert climate zone, which means that it receives very little rainfall throughout the year. The average annual rainfall in Marrakech is only 2-3 inches (5-8 cm).\n\nThe best time to visit Marrakech is between October and April, when the weather is pleasant and the city is less crowded. However, if you're interested in visiting during the summer, the best time to visit is between June and September, when the weather is cooler and the city is less crowded."
      ],
      "context_set": "weather"
    },
    {
      "tag": "telecome oparators",
      "patterns": [
        "Which telecom operators are available in Marrakech?",
        "What are the major telecom companies in Marrakech?",
        "Can I buy a SIM card in Marrakech?",
        "Where can I buy a SIM card in Marrakech?",
        "What documents do I need to buy a SIM card in Marrakech?",
        "How much does a SIM card cost in Marrakech?",
        "What are the rates for data and calling in Marrakech?",
        "Is there a prepaid option for data and calling in Marrakech?",
        "What are the best prepaid plans for data and calling in Marrakech?",
        "How do I recharge my prepaid account in Marrakech?",
        "Can I use my mobile phone in Marrakech?",
        "What is the network coverage like in Marrakech?",
        "Which network has the best coverage in Marrakech?",
        "Can I get a mobile hotspot in Marrakech?",
        "How much does it cost to rent a mobile hotspot in Marrakech?",
        "What are the internet speed options in Marrakech?",
        "How can I check my data balance in Marrakech?",
        "Is there a customer service hotline for telecom operators in Marrakech?",
        "How do I contact customer service for my telecom operator in Marrakech?",
        "What languages are supported by customer service in Marrakech?",
        "How do I activate international roaming on my phone in Marrakech?",
        "What are the international roaming rates in Marrakech?",
        "How can I check my international roaming balance in Marrakech?",
        "Is there free Wi-Fi available in Marrakech?",
        "Where can I find free Wi-Fi in Marrakech?",
        "How do I connect to free Wi-Fi in Marrakech?",
        "Is it safe to use public Wi-Fi in Marrakech?",
        "How can I protect my personal information when using public Wi-Fi in Marrakech?",
        "What is the best way to stay connected while traveling in Marrakech?",
        "Are there any special telecom deals for tourists in Marrakech?"
      ],
      "responses": [
        "There are several telecom operators in Marrakech, including Maroc Telecom, Orange, and Inwi. All three telecom operators offer prepaid SIM cards, which can be purchased at any of their stores or at kiosks in the city. The cost of a SIM card varies depending on the telecom operator, but it's usually around 50-100 Moroccan Dirhams (MAD).\n\nThe rates for data and calling vary depending on the telecom operator, but they're usually around 10-20 Moroccan Dirhams (MAD) per gigabyte (GB) of data and 1-2 Moroccan Dirhams (MAD) per minute of calling. Most telecom operators offer prepaid plans for data and calling, which can be purchased at any of their stores or at kiosks in the city. The cost of a prepaid plan varies depending on the telecom operator, but it's usually around 50-100 Moroccan Dirhams (MAD).\n\nThe best way to stay connected while traveling in Marrakech is to purchase a prepaid SIM card from one of the major telecom operators. This will allow you to make calls and use data at a reasonable price. You can also use your mobile phone in Marrakech, but you'll need to purchase an international roaming plan from your telecom operator before you leave home. If you don't have an international roaming plan, you can still use your mobile phone in Marrakech, but you'll need to pay a high roaming fee for each call or text message you make."
      ],
      "context_set": "telecome oparators"
    },
    {
      "tag": "safety",
      "patterns": [
        "What are some safety tips for tourists in Marrakech?",
        "Is it safe to walk around Marrakech at night?",
        "What areas should I avoid in Marrakech?",
        "What is the crime rate in Marrakech?",
        "Are there any scams I should be aware of in Marrakech?",
        "Are there any health risks I should be aware of in Marrakech?",
        "Are there any areas in Marrakech that are prone to natural disasters?",
        "Is it safe to carry large amounts of cash in Marrakech?",
        "What should I do if I am robbed in Marrakech?",
        "Are there any areas in Marrakech that are known for pickpocketing?",
        "What should I do if I feel unsafe in Marrakech?",
        "Are there any areas in Marrakech that have a high accident rate?",
        "Are there any safety concerns with using ATMs in Marrakech?",
        "Are there any safety concerns with drinking tap water in Marrakech?",
        "What should I do if I become ill while in Marrakech?",
        "Are there any safety concerns with eating street food in Marrakech?",
        "What is the best way to keep my valuables safe in Marrakech?",
        "Are there any safety concerns with taking taxis in Marrakech?",
        "What should I do if I am approached by beggars in Marrakech?",
        "Is it safe to use my credit card in Marrakech?",
        "Are there any safety concerns with using public restrooms in Marrakech?",
        "Are there any safety concerns with taking photographs in Marrakech?",
        "Is it safe to visit Marrakech during Ramadan?",
        "Are there any safety concerns with visiting Marrakech during Ramadan?",
        "What should I do if I am approached by a police officer in Marrakech?",
        "Are there any safety concerns with visiting Marrakech during the winter?",
        "What should I do if I am approached by a street vendor in Marrakech?",
        "Are there any safety concerns with visiting Marrakech during the summer?",
        "What should I do if I am approached by a street performer in Marrakech?",
        "Are there any safety concerns with visiting Marrakech during the spring?",
        "What should I do if I am approached by a street artist in Marrakech?",
        "Are there any safety concerns with visiting Marrakech during the fall?",
        "What should I do if I am approached by a street musician in Marrakech?",
        "Are there any safety concerns with visiting Marrakech during the holiday season?",
        "is marrakech a safe city?"
      ],
      "responses": [
        "As a general safety precaution, tourists in Marrakech should be aware of their surroundings and avoid walking alone at night. It is also important to keep valuables safe and be cautious of scams and pickpocketing. In case of an emergency, the local emergency number is 19. It is also recommended to drink bottled water and be cautious of street food. When using public Bus or taxis, only use official services and negotiate the fare beforehand. Additionally, it is important to respect local customs and dress modestly, especially when visiting religious sites. Smoking is generally allowed in designated areas, but it is always best to check local regulations."
      ],
      "context_set": "safety"
    },
    {
      "tag": "currency",
      "patterns": [
        "What is the official currency of Morocco?",
        "What type of currency is used in Morocco?",
        "What is the monetary unit of Morocco?",
        "Which currency is used in Morocco?",
        "Which currency is legal tender in Morocco?",
        "What is the name of the currency used in Morocco?",
        "What currency should I bring to Morocco?",
        "Is the Moroccan currency different from the Euro?",
        "Do I need to exchange my currency for Moroccan Dirhams?",
        "How does the Moroccan currency compare to the US Dollar?",
        "Can I use Euros in Morocco, or should I exchange for Dirhams?",
        "What exchange rate should I expect for Moroccan Dirhams?",
        "Should I exchange currency at the airport in Morocco?",
        "What is the exchange rate for Moroccan Dirhams at the airport?",
        "What denominations are available for Moroccan Dirhams?",
        "What is the symbol for the Moroccan currency?",
        "What is the history of the Moroccan currency?",
        "Are there any limitations or regulations on exchanging currency in Morocco?",
        "Can I use credit cards instead of Moroccan Dirhams?",
        "What is the current value of the Moroccan Dirham compared to other currencies?",
        "Can I obtain Moroccan Dirhams outside of Morocco?",
        "What is the process for exchanging currency in Morocco?",
        "What are some tips for managing currency in Morocco?",
        "How can I find the best exchange rate for Moroccan Dirhams?",
        "Are there any fees associated with exchanging currency in Morocco?",
        "Which banks or exchange offices offer the best rates for Moroccan Dirhams?",
        "Is exchanging currency in Morocco safe and reliable?",
        "Can I use my home country's currency in Morocco?",
        "What is the most convenient way to obtain Moroccan Dirhams while in Morocco?",
        "Can I use traveler's checks to obtain Moroccan Dirhams?"
      ],
      "responses": [
        "The Official currency of Morocco is the Moroccan Dirham (MAD). The Dirham is divided into 100 centimes. The Dirham is available in denominations of 10, 20, 50, 100 and 200 Dirhams. Coins are available in denominations of 1, 5, 10, 20 and 50 centimes, as well as 1, 2, 5 and 10 Dirhams. The Dirham is a closed currency, which means it can only be traded within Morocco. It is recommended to exchange currency at a bank or official exchange office. It is also recommended to keep receipts when exchanging currency, as they may be required when exchanging back to your home currency. It is also recommended to keep small bills on hand, as it is common for vendors to not have change for larger bills. Additionally, it is important to keep in mind that many vendors do not accept credit cards, so it is best to have cash on hand. "
      ],
      "context_set": "currency"
    },
    {
      "tag": "morocco",
      "patterns": [
        "What is the population of Morocco?",
        "What is the estimated number of people living in Morocco?",
        "How many people reside in Morocco?",
        "How many individuals inhabit Morocco?",
        "How many people are there in Morocco?",
        "What is the size of population in Morocco?",
        "What is the population of Morocco at present?",
        "What is the total population of Morocco?",
        "How many residents live in Morocco?",
        "What is the current population of Morocco?",
        "How many citizens in Morocco live?",
        "How many people live in Morocco currently?",
        "How many people are currently in Morocco?",
        "How many people inhabit Morocco right now?",
        "What is the Moroccan population?",
        "How big is the population of Morocco?",
        "What is the population of Morocco nowadays?",
        "What is the amount of people living in Morocco?",
        "How many people are living in Morocco now?",
        "What is the total count of people in Morocco?",
        "How many people reside in Morocco presently?",
        "How many people dwell in Morocco nowadays?",
        "What is the approximate number of people living in Morocco?",
        "What is the population of Morocco at the moment?",
        "What is the right now population of Morocco?",
        "How many people are currently residing in Morocco?",
        "What is the amount of individuals currently living in Morocco?",
        "What is the number of people currently living in Morocco?"
      ],
      "responses": ["answer "],
      "context_set": ""
    }
  ]
}
